Series

In [1]:
import pandas as pd
first_series = pd.Series([1,2,4,8,16,32,64])
print(type(first_series))
print(first_series)

<class 'pandas.core.series.Series'>
0     1
1     2
2     4
3     8
4    16
5    32
6    64
dtype: int64

In [2]:
import numpy as np
s = pd.Series(np.random.randn(5), index=['a','b','c','d','e'])
print(s)
print('-'*50)
print(s.index)

a    1.748236
b   -0.701544
c   -1.190610
d    0.484931
e   -0.445778
dtype: float64
--------------------------------------------------
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [3]:
d = {'a':0., 'b':1., 'c':2.}
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [4]:
pd.Series(d, index=['a','b','c','d'])

a    0.0
b    1.0
c    2.0
d    NaN
dtype: float64

In [5]:
pd.Series(5, index=['a','b','c'])

a    5
b    5
c    5
dtype: int64

In [6]:
s = pd.Series(np.random.randn(5), index=['a','b','c','d','e'])
print(s)

a    0.436339
b    0.334438
c    1.600035
d    2.273996
e    0.439803
dtype: float64

In [7]:
print(s[0])
print(s[:3])
print(s[s>s.mean()])
print(np.exp(s))

0.43633913984506406
a    0.436339
b    0.334438
c    1.600035
dtype: float64
c    1.600035
d    2.273996
dtype: float64
a    1.547033
b    1.397155
c    4.953205
d    9.718155
e    1.552401
dtype: float64

In [8]:
print(s['a'])

0.43633913984506406

In [9]:
s['e'] = 12
s

a     0.436339
b     0.334438
c     1.600035
d     2.273996
e    12.000000
dtype: float64

In [10]:
print(s.index)
print(s.values)
print(s.shape)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[ 0.43633914  0.33443788  1.60003486  2.27399575 12.        ]
(5,)

In [11]:
for idx,val in s.items():
    print(idx,val)

a 0.43633913984506406
b 0.3344378846100455
c 1.600034857451066
d 2.273995747629336
e 12.0

In [12]:
print(s.sort_index())
print(s.sort_values())

a     0.436339
b     0.334438
c     1.600035
d     2.273996
e    12.000000
dtype: float64
b     0.334438
a     0.436339
c     1.600035
d     2.273996
e    12.000000
dtype: float64

In [13]:
s = pd.Series([0,0,0,1,1,1,2,2,2,2])
print(s.value_counts())

2    4
1    3
0    3
dtype: int64

In [14]:
print(s.mean())
print(s.median())
print(s.mode())
print(s.nsmallest(2))
print(s.max())
print(s.min())

1.1
1.0
0    2
dtype: int64
0    0
1    0
dtype: int64
2
0

DataFrame

In [15]:
d = {'one':pd.Series([1,2,3], index=['a','b','c']),
    'two': pd.Series(list(range(4)), index=['a','b','c','d'])}
print(d)
df = pd.DataFrame(d)
print(df)

{'one': a    1
b    2
c    3
dtype: int64, 'two': a    0
b    1
c    2
d    3
dtype: int64}
   one  two
a  1.0    0
b  2.0    1
c  3.0    2
d  NaN    3

In [16]:
print(pd.DataFrame(d, index=['d','b','a']))

   one  two
d  NaN    3
b  2.0    1
a  1.0    0

In [17]:
print(pd.DataFrame(d, index=['d','b','a'], columns=['two','three']))

   two three
d    3   NaN
b    1   NaN
a    0   NaN

In [18]:
print(df.index)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [19]:
print(df.columns)

Index(['one', 'two'], dtype='object')

In [20]:
print(df.shape)

(4, 2)

In [21]:
d = {'one':[1.,2.,3.,4.], 'two':[4.,3.,2.,1.]}
print(d)
df = pd.DataFrame(d)
print(df)

{'one': [1.0, 2.0, 3.0, 4.0], 'two': [4.0, 3.0, 2.0, 1.0]}
   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [22]:
data = []
for i in range(100):
    row = {}
    for j in range(5):
        row['Column'+ str(j)] = np.random.randint(100)
    data.append(row)
print(data)

[{'Column0': 83, 'Column1': 70, 'Column2': 43, 'Column3': 69, 'Column4': 86}, {'Column0': 67, 'Column1': 18, 'Column2': 11, 'Column3': 32, 'Column4': 69}, {'Column0': 86, 'Column1': 8, 'Column2': 49, 'Column3': 9, 'Column4': 76}, {'Column0': 53, 'Column1': 59, 'Column2': 8, 'Column3': 96, 'Column4': 13}, {'Column0': 10, 'Column1': 43, 'Column2': 5, 'Column3': 86, 'Column4': 72}, {'Column0': 48, 'Column1': 34, 'Column2': 76, 'Column3': 96, 'Column4': 99}, {'Column0': 65, 'Column1': 43, 'Column2': 94, 'Column3': 50, 'Column4': 51}, {'Column0': 16, 'Column1': 34, 'Column2': 65, 'Column3': 39, 'Column4': 24}, {'Column0': 65, 'Column1': 57, 'Column2': 53, 'Column3': 28, 'Column4': 53}, {'Column0': 19, 'Column1': 27, 'Column2': 25, 'Column3': 84, 'Column4': 93}, {'Column0': 45, 'Column1': 9, 'Column2': 78, 'Column3': 57, 'Column4': 63}, {'Column0': 66, 'Column1': 98, 'Column2': 50, 'Column3': 67, 'Column4': 81}, {'Column0': 63, 'Column1': 7, 'Column2': 6, 'Column3': 22, 'Column4': 77}, {'Column0': 28, 'Column1': 62, 'Column2': 76, 'Column3': 17, 'Column4': 83}, {'Column0': 28, 'Column1': 67, 'Column2': 97, 'Column3': 18, 'Column4': 97}, {'Column0': 95, 'Column1': 73, 'Column2': 45, 'Column3': 56, 'Column4': 46}, {'Column0': 88, 'Column1': 33, 'Column2': 28, 'Column3': 43, 'Column4': 59}, {'Column0': 7, 'Column1': 77, 'Column2': 74, 'Column3': 97, 'Column4': 71}, {'Column0': 32, 'Column1': 8, 'Column2': 72, 'Column3': 77, 'Column4': 66}, {'Column0': 56, 'Column1': 58, 'Column2': 59, 'Column3': 51, 'Column4': 35}, {'Column0': 89, 'Column1': 74, 'Column2': 60, 'Column3': 36, 'Column4': 6}, {'Column0': 90, 'Column1': 49, 'Column2': 62, 'Column3': 72, 'Column4': 54}, {'Column0': 56, 'Column1': 34, 'Column2': 4, 'Column3': 68, 'Column4': 16}, {'Column0': 59, 'Column1': 57, 'Column2': 21, 'Column3': 3, 'Column4': 40}, {'Column0': 31, 'Column1': 12, 'Column2': 50, 'Column3': 81, 'Column4': 32}, {'Column0': 44, 'Column1': 12, 'Column2': 74, 'Column3': 6, 'Column4': 32}, {'Column0': 80, 'Column1': 94, 'Column2': 32, 'Column3': 12, 'Column4': 26}, {'Column0': 46, 'Column1': 15, 'Column2': 63, 'Column3': 11, 'Column4': 47}, {'Column0': 8, 'Column1': 10, 'Column2': 95, 'Column3': 86, 'Column4': 28}, {'Column0': 40, 'Column1': 89, 'Column2': 59, 'Column3': 8, 'Column4': 74}, {'Column0': 18, 'Column1': 31, 'Column2': 8, 'Column3': 44, 'Column4': 54}, {'Column0': 61, 'Column1': 95, 'Column2': 58, 'Column3': 5, 'Column4': 9}, {'Column0': 13, 'Column1': 21, 'Column2': 50, 'Column3': 85, 'Column4': 69}, {'Column0': 91, 'Column1': 28, 'Column2': 60, 'Column3': 75, 'Column4': 66}, {'Column0': 58, 'Column1': 31, 'Column2': 90, 'Column3': 81, 'Column4': 69}, {'Column0': 76, 'Column1': 54, 'Column2': 40, 'Column3': 68, 'Column4': 82}, {'Column0': 26, 'Column1': 79, 'Column2': 70, 'Column3': 33, 'Column4': 49}, {'Column0': 27, 'Column1': 6, 'Column2': 48, 'Column3': 79, 'Column4': 39}, {'Column0': 25, 'Column1': 43, 'Column2': 34, 'Column3': 28, 'Column4': 12}, {'Column0': 20, 'Column1': 90, 'Column2': 72, 'Column3': 86, 'Column4': 61}, {'Column0': 99, 'Column1': 11, 'Column2': 35, 'Column3': 7, 'Column4': 66}, {'Column0': 73, 'Column1': 45, 'Column2': 44, 'Column3': 79, 'Column4': 39}, {'Column0': 41, 'Column1': 86, 'Column2': 15, 'Column3': 46, 'Column4': 26}, {'Column0': 27, 'Column1': 84, 'Column2': 59, 'Column3': 39, 'Column4': 83}, {'Column0': 0, 'Column1': 38, 'Column2': 40, 'Column3': 82, 'Column4': 42}, {'Column0': 77, 'Column1': 59, 'Column2': 40, 'Column3': 73, 'Column4': 85}, {'Column0': 41, 'Column1': 93, 'Column2': 56, 'Column3': 49, 'Column4': 42}, {'Column0': 42, 'Column1': 4, 'Column2': 27, 'Column3': 50, 'Column4': 11}, {'Column0': 69, 'Column1': 9, 'Column2': 16, 'Column3': 71, 'Column4': 91}, {'Column0': 1, 'Column1': 48, 'Column2': 15, 'Column3': 72, 'Column4': 27}, {'Column0': 34, 'Column1': 62, 'Column2': 64, 'Column3': 5, 'Column4': 51}, {'Column0': 36, 'Column1': 88, 'Column2': 34, 'Column3': 77, 'Column4': 33}, {'Column0': 85, 'Column1': 12, 'Column2': 28, 'Column3': 59, 'Column4': 94}, {'Column0': 19, 'Column1': 85, 'Column2': 88, 'Column3': 60, 'Column4': 69}, {'Column0': 47, 'Column1': 77, 'Column2': 69, 'Column3': 9, 'Column4': 92}, {'Column0': 58, 'Column1': 97, 'Column2': 21, 'Column3': 8, 'Column4': 51}, {'Column0': 51, 'Column1': 87, 'Column2': 39, 'Column3': 36, 'Column4': 78}, {'Column0': 99, 'Column1': 14, 'Column2': 41, 'Column3': 47, 'Column4': 71}, {'Column0': 11, 'Column1': 13, 'Column2': 71, 'Column3': 36, 'Column4': 64}, {'Column0': 27, 'Column1': 71, 'Column2': 12, 'Column3': 57, 'Column4': 66}, {'Column0': 49, 'Column1': 63, 'Column2': 44, 'Column3': 0, 'Column4': 82}, {'Column0': 64, 'Column1': 11, 'Column2': 62, 'Column3': 57, 'Column4': 86}, {'Column0': 1, 'Column1': 52, 'Column2': 72, 'Column3': 75, 'Column4': 5}, {'Column0': 32, 'Column1': 53, 'Column2': 82, 'Column3': 31, 'Column4': 26}, {'Column0': 33, 'Column1': 85, 'Column2': 78, 'Column3': 23, 'Column4': 35}, {'Column0': 87, 'Column1': 22, 'Column2': 27, 'Column3': 85, 'Column4': 57}, {'Column0': 67, 'Column1': 81, 'Column2': 94, 'Column3': 34, 'Column4': 18}, {'Column0': 41, 'Column1': 22, 'Column2': 37, 'Column3': 6, 'Column4': 2}, {'Column0': 66, 'Column1': 32, 'Column2': 12, 'Column3': 69, 'Column4': 22}, {'Column0': 92, 'Column1': 65, 'Column2': 29, 'Column3': 48, 'Column4': 51}, {'Column0': 30, 'Column1': 99, 'Column2': 2, 'Column3': 99, 'Column4': 42}, {'Column0': 9, 'Column1': 68, 'Column2': 82, 'Column3': 6, 'Column4': 65}, {'Column0': 2, 'Column1': 4, 'Column2': 90, 'Column3': 21, 'Column4': 10}, {'Column0': 15, 'Column1': 28, 'Column2': 23, 'Column3': 22, 'Column4': 30}, {'Column0': 0, 'Column1': 74, 'Column2': 58, 'Column3': 37, 'Column4': 64}, {'Column0': 69, 'Column1': 37, 'Column2': 79, 'Column3': 22, 'Column4': 50}, {'Column0': 12, 'Column1': 96, 'Column2': 7, 'Column3': 12, 'Column4': 37}, {'Column0': 0, 'Column1': 29, 'Column2': 5, 'Column3': 28, 'Column4': 81}, {'Column0': 36, 'Column1': 83, 'Column2': 17, 'Column3': 94, 'Column4': 8}, {'Column0': 8, 'Column1': 11, 'Column2': 83, 'Column3': 73, 'Column4': 15}, {'Column0': 42, 'Column1': 75, 'Column2': 96, 'Column3': 32, 'Column4': 96}, {'Column0': 26, 'Column1': 25, 'Column2': 85, 'Column3': 74, 'Column4': 68}, {'Column0': 39, 'Column1': 98, 'Column2': 57, 'Column3': 87, 'Column4': 61}, {'Column0': 37, 'Column1': 20, 'Column2': 76, 'Column3': 50, 'Column4': 43}, {'Column0': 85, 'Column1': 50, 'Column2': 71, 'Column3': 40, 'Column4': 80}, {'Column0': 88, 'Column1': 94, 'Column2': 22, 'Column3': 48, 'Column4': 64}, {'Column0': 21, 'Column1': 28, 'Column2': 27, 'Column3': 29, 'Column4': 63}, {'Column0': 13, 'Column1': 67, 'Column2': 57, 'Column3': 7, 'Column4': 80}, {'Column0': 10, 'Column1': 97, 'Column2': 62, 'Column3': 15, 'Column4': 76}, {'Column0': 17, 'Column1': 36, 'Column2': 84, 'Column3': 75, 'Column4': 4}, {'Column0': 1, 'Column1': 5, 'Column2': 49, 'Column3': 41, 'Column4': 83}, {'Column0': 26, 'Column1': 23, 'Column2': 14, 'Column3': 30, 'Column4': 69}, {'Column0': 49, 'Column1': 90, 'Column2': 31, 'Column3': 40, 'Column4': 55}, {'Column0': 79, 'Column1': 40, 'Column2': 63, 'Column3': 36, 'Column4': 66}, {'Column0': 56, 'Column1': 16, 'Column2': 51, 'Column3': 30, 'Column4': 89}, {'Column0': 94, 'Column1': 16, 'Column2': 20, 'Column3': 27, 'Column4': 25}, {'Column0': 38, 'Column1': 22, 'Column2': 50, 'Column3': 53, 'Column4': 93}, {'Column0': 55, 'Column1': 86, 'Column2': 32, 'Column3': 38, 'Column4': 79}, {'Column0': 37, 'Column1': 91, 'Column2': 80, 'Column3': 97, 'Column4': 45}, {'Column0': 57, 'Column1': 75, 'Column2': 56, 'Column3': 69, 'Column4': 19}]

In [23]:
data[:5]

[{'Column0': 83, 'Column1': 70, 'Column2': 43, 'Column3': 69, 'Column4': 86},
 {'Column0': 67, 'Column1': 18, 'Column2': 11, 'Column3': 32, 'Column4': 69},
 {'Column0': 86, 'Column1': 8, 'Column2': 49, 'Column3': 9, 'Column4': 76},
 {'Column0': 53, 'Column1': 59, 'Column2': 8, 'Column3': 96, 'Column4': 13},
 {'Column0': 10, 'Column1': 43, 'Column2': 5, 'Column3': 86, 'Column4': 72}]

In [24]:
df = pd.DataFrame(data)
print(df.head())

   Column0  Column1  Column2  Column3  Column4
0       83       70       43       69       86
1       67       18       11       32       69
2       86        8       49        9       76
3       53       59        8       96       13
4       10       43        5       86       72

In [25]:
df = pd.DataFrame(data, columns=['Column0','Column1'])
print(df.head())

   Column0  Column1
0       83       70
1       67       18
2       86        8
3       53       59
4       10       43

In [26]:
print(df.index)
print(df.columns)
print(df.shape)
print(df.values)

RangeIndex(start=0, stop=100, step=1)
Index(['Column0', 'Column1'], dtype='object')
(100, 2)
[[83 70]
 [67 18]
 [86  8]
 [53 59]
 [10 43]
 [48 34]
 [65 43]
 [16 34]
 [65 57]
 [19 27]
 [45  9]
 [66 98]
 [63  7]
 [28 62]
 [28 67]
 [95 73]
 [88 33]
 [ 7 77]
 [32  8]
 [56 58]
 [89 74]
 [90 49]
 [56 34]
 [59 57]
 [31 12]
 [44 12]
 [80 94]
 [46 15]
 [ 8 10]
 [40 89]
 [18 31]
 [61 95]
 [13 21]
 [91 28]
 [58 31]
 [76 54]
 [26 79]
 [27  6]
 [25 43]
 [20 90]
 [99 11]
 [73 45]
 [41 86]
 [27 84]
 [ 0 38]
 [77 59]
 [41 93]
 [42  4]
 [69  9]
 [ 1 48]
 [34 62]
 [36 88]
 [85 12]
 [19 85]
 [47 77]
 [58 97]
 [51 87]
 [99 14]
 [11 13]
 [27 71]
 [49 63]
 [64 11]
 [ 1 52]
 [32 53]
 [33 85]
 [87 22]
 [67 81]
 [41 22]
 [66 32]
 [92 65]
 [30 99]
 [ 9 68]
 [ 2  4]
 [15 28]
 [ 0 74]
 [69 37]
 [12 96]
 [ 0 29]
 [36 83]
 [ 8 11]
 [42 75]
 [26 25]
 [39 98]
 [37 20]
 [85 50]
 [88 94]
 [21 28]
 [13 67]
 [10 97]
 [17 36]
 [ 1  5]
 [26 23]
 [49 90]
 [79 40]
 [56 16]
 [94 16]
 [38 22]
 [55 86]
 [37 91]
 [57 75]]

In [27]:
d = {'one':pd.Series([1,2,3], index=['a','b','c']),
    'two': pd.Series(list(range(4)), index=['a','b','c','d'])}
df = pd.DataFrame(d)
print(df)
df['three'] = df['one']*df['two']
df['flag'] = df['one']>2
print(df.head())

   one  two
a  1.0    0
b  2.0    1
c  3.0    2
d  NaN    3
   one  two  three   flag
a  1.0    0    0.0  False
b  2.0    1    2.0  False
c  3.0    2    6.0   True
d  NaN    3    NaN  False

In [28]:
three = df.pop('three')
print(three)
print(df.head())

a    0.0
b    2.0
c    6.0
d    NaN
Name: three, dtype: float64
   one  two   flag
a  1.0    0  False
b  2.0    1  False
c  3.0    2   True
d  NaN    3  False

In [29]:
df['foo']='bar'
print(df.head())

   one  two   flag  foo
a  1.0    0  False  bar
b  2.0    1  False  bar
c  3.0    2   True  bar
d  NaN    3  False  bar

In [30]:
print(df[['two','foo']]) # select column
print('\n')
print(df.loc['b']) # select row by label
print('\n')
print(df.iloc[2:,:]) # select row by integer location
print('\n')
print(df['a':'c']) # slice rows
print('\n')
print(df.mask(df> 1)) # select rows by boolean

   two  foo
a    0  bar
b    1  bar
c    2  bar
d    3  bar


one         2
two         1
flag    False
foo       bar
Name: b, dtype: object


   one  two   flag  foo
c  3.0    2   True  bar
d  NaN    3  False  bar


   one  two   flag  foo
a  1.0    0  False  bar
b  2.0    1  False  bar
c  3.0    2   True  bar


   one  two   flag  foo
a  1.0  0.0  False  NaN
b  NaN  1.0  False  NaN
c  NaN  NaN   True  NaN
d  NaN  NaN  False  NaN

In [31]:
pd.options.display.max_rows = 4
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8,4), index=dates, columns=['A','B','C','D'])
df.head()

                   A         B         C         D
2000-01-01 -0.766905 -1.099917  1.526191 -0.760668
2000-01-02 -1.345469  1.479332 -0.499637 -0.577389
...              ...       ...       ...       ...
2000-01-04 -0.142041 -1.417811  2.263640  0.791886
2000-01-05  0.087137  0.733263 -0.593410  0.121478

[5 rows x 4 columns]

In [32]:
df['A']

2000-01-01   -0.766905
2000-01-02   -1.345469
                ...
2000-01-07    2.465213
2000-01-08   -1.254809
Freq: D, Name: A, Length: 8, dtype: float64

In [33]:
df[['A','B']]

                   A         B
2000-01-01 -0.766905 -1.099917
2000-01-02 -1.345469  1.479332
...              ...       ...
2000-01-07  2.465213  0.295082
2000-01-08 -1.254809 -1.521784

[8 rows x 2 columns]

In [34]:
df['2000-01-01':'2000-01-05']

                   A         B         C         D
2000-01-01 -0.766905 -1.099917  1.526191 -0.760668
2000-01-02 -1.345469  1.479332 -0.499637 -0.577389
...              ...       ...       ...       ...
2000-01-04 -0.142041 -1.417811  2.263640  0.791886
2000-01-05  0.087137  0.733263 -0.593410  0.121478

[5 rows x 4 columns]

In [35]:
df[df['B'] > df['C']].head() # only rows which column B > column C are shown

                   A         B         C         D
2000-01-02 -1.345469  1.479332 -0.499637 -0.577389
2000-01-03 -1.714920 -0.691033 -1.101853 -1.084277
...              ...       ...       ...       ...
2000-01-06  0.165722  1.195298 -0.039066 -0.747085
2000-01-07  2.465213  0.295082 -1.401379  0.450560

[5 rows x 4 columns]

In [36]:
df['A'] = df['B'].values
df.head()

                   A         B         C         D
2000-01-01 -1.099917 -1.099917  1.526191 -0.760668
2000-01-02  1.479332  1.479332 -0.499637 -0.577389
...              ...       ...       ...       ...
2000-01-04 -1.417811 -1.417811  2.263640  0.791886
2000-01-05  0.733263  0.733263 -0.593410  0.121478

[5 rows x 4 columns]

In [37]:
df.loc['2000-01-04']

A   -1.417811
B   -1.417811
C    2.263640
D    0.791886
Name: 2000-01-04 00:00:00, dtype: float64

In [38]:
df.loc['2000-01-04':,['A','B']]

                   A         B
2000-01-04 -1.417811 -1.417811
2000-01-05  0.733263  0.733263
...              ...       ...
2000-01-07  0.295082  0.295082
2000-01-08 -1.521784 -1.521784

[5 rows x 2 columns]

In [39]:
df.loc[[True,False,True,False,True]] # showing skipped columns based on boolean

                   A         B         C         D
2000-01-01 -1.099917 -1.099917  1.526191 -0.760668
2000-01-03 -0.691033 -0.691033 -1.101853 -1.084277
2000-01-05  0.733263  0.733263 -0.593410  0.121478

In [40]:
df1 = pd.DataFrame(np.random.randn(6,4), index=list(range(0,12,2)), 
                   columns=list(range(0,12,3)))
print(df1)

           0         3         6         9
0   0.199769  1.096518 -0.961154  1.864665
2   1.514902 -0.606221 -0.115089 -0.416125
..       ...       ...       ...       ...
8   0.282331  0.980553 -0.551285 -1.097887
10  0.087102  1.021569  0.354572 -1.056896

[6 rows x 4 columns]

In [41]:
df1.iloc[:3]

          0         3         6         9
0  0.199769  1.096518 -0.961154  1.864665
2  1.514902 -0.606221 -0.115089 -0.416125
4 -0.765732  0.013940  0.010505 -3.024530

In [42]:
df1.iloc[1:5,2:4]

          6         9
2 -0.115089 -0.416125
4  0.010505 -3.024530
6 -0.462344 -0.880428
8 -0.551285 -1.097887

In [43]:
df1.iloc[[1,3,5],[1,3]]

           3         9
2  -0.606221 -0.416125
6  -1.081240 -0.880428
10  1.021569 -1.056896

In [44]:
boolean_mask = df1.iloc[:,1] > 0.05
df1.iloc[boolean_mask.values,1]

0     1.096518
8     0.980553
10    1.021569
Name: 3, dtype: float64

In [45]:
df1 = pd.DataFrame(np.random.randn(6,4), index=list(range(0,12,2)), 
                   columns=list('abcd'))
df1

           a         b         c         d
0  -1.184598 -0.547340 -1.616546  0.477289
2   0.611497 -0.600979  0.667487 -0.528100
..       ...       ...       ...       ...
8   0.085455  0.542702 -0.957065  0.581615
10  0.731442  0.998909 -0.269430  0.079461

[6 rows x 4 columns]

In [46]:
df1.loc[lambda x:(x.a > 0) & (x.b > 0), ['a','b']]

           a         b
8   0.085455  0.542702
10  0.731442  0.998909

In [47]:
df1[df1['a'] > 0]

           a         b         c         d
2   0.611497 -0.600979  0.667487 -0.528100
8   0.085455  0.542702 -0.957065  0.581615
10  0.731442  0.998909 -0.269430  0.079461

In [48]:
df1[~(df1['a'] < 0)]

           a         b         c         d
2   0.611497 -0.600979  0.667487 -0.528100
8   0.085455  0.542702 -0.957065  0.581615
10  0.731442  0.998909 -0.269430  0.079461

In [49]:
df1[(df1['a'] < 0)]

          a         b         c         d
0 -1.184598 -0.547340 -1.616546  0.477289
4 -1.766116  0.175660 -0.548450  0.332899
6 -0.105759  0.487688  0.968023  0.497398

In [50]:
df2 = pd.DataFrame({'a': ['one','one','two','three','two','one','six'],
                   'b': ['x','y','y','x','y','x','x'], 'c': np.random.randn(7)})
df2

      a  b         c
0   one  x  0.347247
1   one  y -1.538315
..  ... ..       ...
5   one  x -0.871531
6   six  x -0.750525

[7 rows x 3 columns]

In [51]:
criterion = df2['a'].map(lambda x: x.startswith('t'))
df2.loc[criterion,'c'] = 5

In [52]:
df2[criterion]

       a  b    c
2    two  y  5.0
3  three  x  5.0
4    two  y  5.0

In [53]:
df2[~criterion]

     a  b         c
0  one  x  0.347247
1  one  y -1.538315
5  one  x -0.871531
6  six  x -0.750525

In [54]:
s = pd.Series(np.arange(5), index=np.arange(5)[::1], dtype='int64')
s.isin([2,4,1])

0    False
1     True
     ...
3    False
4     True
Length: 5, dtype: bool

In [55]:
criterion = (df2['a'].isin(['one','three']) & df2['b'].isin(['x']))
df2[criterion]

       a  b         c
0    one  x  0.347247
3  three  x  5.000000
5    one  x -0.871531

In [56]:
data = pd.read_csv('iris.data', header=None)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
0    150 non-null float64
1    150 non-null float64
2    150 non-null float64
3    150 non-null float64
4    150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

In [57]:
data.head()

      0    1    2    3            4
0   5.1  3.5  1.4  0.2  Iris-setosa
1   4.9  3.0  1.4  0.2  Iris-setosa
..  ...  ...  ...  ...          ...
3   4.6  3.1  1.5  0.2  Iris-setosa
4   5.0  3.6  1.4  0.2  Iris-setosa

[5 rows x 5 columns]

In [58]:
pd.options.display.max_rows = None
data.describe()

                0           1           2           3
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.054000    3.758667    1.198667
std      0.828066    0.433594    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [59]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'], 'D':['D0','D1','D2','D3']},
                  index=[0,1,2,3])
print(df1)
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'], 'D':['D4','D5','D6','D7'],
                   },index=[4,5,6,7])
print('\n')
print(df2)
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],'D':['D8','D9','D10','D11']},
                  index=[8,9,10,11])
print('\n')
print(df3)
df4 = pd.DataFrame({'B':['B2','B3','B6','B7'], 'D':['D2','D3','D6','D7'],
                   'F':['F2','F3','F6','F7']},
                  index=[2,3,6,7])
print('\n')
print(df4)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3


    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7


      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11


    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [60]:
pd.options.display.max_rows = 12
results = pd.concat([df1,df2,df3])
print(results)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [61]:
results = pd.concat([df1,df2,df3], keys=['a','b','c'])
print(results)

        A    B    C    D
a 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
b 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
c 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [62]:
results.loc['a']

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [63]:
print(df1)
print('\n')
print(df4)
result2 = pd.concat([df1,df4], axis=1)
print('\n')
print(result2)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3


    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7


     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [64]:
result3 = pd.concat([df1,df4], axis=1, join='inner')
print(result3)

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [65]:
result4 = pd.concat([df1,df4], axis=1, join_axes=[df1.index])
print(result4)

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [66]:
print(df1)
print('\n')
print(df2)
print('\n')
df1.append(df2)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3


    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [67]:
print(df1)
print('\n')
print(df4)
print('\n')
df1.append(df4, sort=False)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3


    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [68]:
print(df1)
print('\n')
print(df2)
print('\n')
print(df3)
print('\n')
df1.append([df2,df3])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3


    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7


      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [69]:
print(df1)
print('\n')
print(df4)
print('\n')
pd.concat([df1,df4], sort=False, ignore_index=True)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3


    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [70]:
left = pd.DataFrame({'key':['foo','foo'], 'lval':[1,2]})
print(left)
right = pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})
print('\n')
print(right)
merged = pd.merge(left, right, on='key')
print('\n')
print(merged)

   key  lval
0  foo     1
1  foo     2


   key  rval
0  foo     4
1  foo     5


   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [71]:
left = pd.DataFrame({'key':['foo','bar'], 'lval':[1,2]})
print(left)
right = pd.DataFrame({'key':['foo','bar'],'rval':[4,5]})
print('\n')
print(right)
merged = pd.merge(left, right, on='key')
print('\n')
print(merged)

   key  lval
0  foo     1
1  bar     2


   key  rval
0  foo     4
1  bar     5


   key  lval  rval
0  foo     1     4
1  bar     2     5

In [72]:
df1 = pd.DataFrame(np.random.randn(6,4), index=list(range(0,12,2)), 
                   columns=list(range(0,12,3)))
print(df1)
print('\n')
df1.apply(np.mean)

           0         3         6         9
0   0.796849 -0.468010 -1.476326 -0.925210
2   0.974891 -0.054504 -1.501600 -0.554972
4   0.961573  0.667783 -0.161394 -0.637102
6  -2.035873 -1.885710  2.132299 -0.151140
8  -0.048181 -0.281087 -1.259189 -0.692013
10  1.636997  1.810832 -1.322764  0.819100

0    0.381043
3   -0.035116
6   -0.598162
9   -0.356889
dtype: float64

In [73]:
df1.apply(np.mean, axis=1)

0    -0.518174
2    -0.284046
4     0.207715
6    -0.485106
8    -0.570117
10    0.736041
dtype: float64

In [74]:
df1.apply(lambda x: (x-x.mean())/x.std(), axis=0)

           0         3         6         9
0   0.319554 -0.351712 -0.614971 -0.903500
2   0.456383 -0.015752 -0.632671 -0.314907
4   0.446147  0.571083  0.305866 -0.445474
6  -1.857441 -1.503548  1.912121  0.327095
8  -0.329866 -0.199844 -0.462912 -0.532770
10  0.965222  1.499773 -0.507433  1.869556

In [75]:
df = pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C'],
                 'data':[0,5,10,5,10,15,10,15,20]})
print(df)

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [77]:
grouped_df=df.groupby('key')
print(grouped_df.get_group('A'))
print('\n')
print(grouped_df.get_group('C'))

  key  data
0   A     0
3   A     5
6   A    10


  key  data
2   C    10
5   C    15
8   C    20